{
  "title": "Project",
  "links": [
    {
      "name": "Home",
      "url": "./"
    },
    {
      "name": "People",
      "url": "people"
    },
    {
      "active": "active",
      "name": "Project",
      "url": "project"
    },
    {
      "name": "Publication",
      "url": "publication"
    },
    {
      "name": "Contact",
      "url": "contact"
    }
  ],
  "projects": [
    {
      "title": "Indoor Spatial Data Management",
      "picture": "indoor-spatial-data-management.jpg",
      "summary": "Today most people spend a significant portion of their time daily in indoor spaces such as subway systems, office buildings, shopping malls, convention centers, and many other structures. In addition, indoor spaces are becoming increasingly large and complex. For instance, the New York City Subway has 468 stations and contains 232 miles of routes. In 2013, the subway system delivered over 1.7 billion rides, averaging approximately 5.5 million rides on weekdays. Therefore, users will have more and more demand for launching spatial queries for finding friends or points of interest in indoor spaces. However, existing spatial query evaluation techniques for outdoor environments (either based on Euclidean distance or network distance) cannot be applied in indoor spaces because these techniques assume that user locations can be acquired from GPS signals or cellular positioning, but the assumption does not hold in covered indoor spaces. Furthermore, indoor spaces are usually modeled differently from outdoor spaces. In indoor environments, user movements are enabled or constrained by entities and topologies such as doors, walls, and hallways. We study various indoor spatial data management challenges in this project."
    },
    {
      "title": "Data Integrity Assurance and Privacy Protection Solutions for Cloud Resources",
      "picture": "../img/data-integrity.jpg",
      "summary": "Cloud computing provides many clear benefits for users, including scalability and reduced system acquisition cost. However, data security, integrity and privacy are becoming major concerns for scientific researchers when they access data from the cloud to conduct experiments or analytics. In addition, data owners may not want to reveal their data to cloud service providers either because of the sensitivity of the data (e.g., medical records) or because of its value. Therefore, it is important to create cloud data integrity assurance and privacy protection solutions that help users fully embrace cloud services as well as protect cyberinfrastructure resources. With a cloud database, data owners can store large-scale datasets collected from various sources. Users can then launch queries retrieving the data records for conducting research and experiments. However, there are several possible threats to query result accuracy. For example, a cloud database could be compromised and the stored data could be tampered with. There could be a malfunction in the cloud server, so that the cloud database inadvertently returns incomplete query results. It is unlikely that the client would be aware of such incorrect or incomplete query results. Consequently, erroneous data could be employed in subsequent scientific experiments or analyses, which could lead to false results. Cloud database query integrity assurance is critical issue that underpins a secure and trustworthy end-to-end scientific workflow. NSF CICI Award: Secure and Resilient Architecture: Data Integrity Assurance and Privacy Protection Solutions for Secure Interoperability of Cloud Resources."
    }
  ]
}
